marmbrus/circuits/roomsensor/src/sdkconfig.defaults
# This config is ignored
# Run idf.py set-target esp32s2
# CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# Enable RAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# Required for ADF compilation
CONFIG_ESP32_S3_BOX_BOARD=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
